Backend/loadtest/k6/results/nginx/auth/report-2026-07-30-025325.txt
     ✓ register status is 201
     ✓ login status is 200

     checks.........................: 100.00% ✓ 1638      ✗ 0   
     data_received..................: 1.3 MB  18 kB/s
     data_sent......................: 542 kB  7.6 kB/s
     http_req_blocked...............: avg=31.64µs  min=0s      med=0s       max=11.05ms  p(90)=0s       p(95)=0s      
     http_req_connecting............: avg=23.44µs  min=0s      med=0s       max=1.82ms   p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=137.58ms min=89.72ms med=133.72ms max=256.99ms p(90)=182.13ms p(95)=194.33ms
       { expected_response:true }...: avg=137.58ms min=89.72ms med=133.72ms max=256.99ms p(90)=182.13ms p(95)=194.33ms
     http_req_failed................: 0.00%   ✓ 0         ✗ 1638
     http_req_receiving.............: avg=74.87µs  min=0s      med=0s       max=1.51ms   p(90)=530.32µs p(95)=571.56µs
     http_req_sending...............: avg=12.13µs  min=0s      med=0s       max=3.56ms   p(90)=0s       p(95)=0s      
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=137.49ms min=89.72ms med=133.64ms max=256.99ms p(90)=182.11ms p(95)=194.07ms
     http_reqs......................: 1638    22.889479/s
     iteration_duration.............: avg=2.27s    min=2.22s   med=2.27s    max=2.36s    p(90)=2.3s     p(95)=2.31s   
     iterations.....................: 819     11.444739/s
     vus............................: 2       min=1       max=50
     vus_max........................: 50      min=50      max=50